public class task6 {
    //Дано натуральное число. Выведите его последнюю цифру. 
    public static void main(String[] args) {
        int a = 102;
        System.out.println(a%10);
    }
}
